ChibiOS/ChibiOS/os/hal/platforms/Rx62n/iodefine_gcc62n.h
#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__DTCE( x )		ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define	 _DTCE( x )		__DTCE( x )
#define	  DTCE( x , y )	_DTCE( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )

#define	AD0		(*(volatile struct st_ad       *)0x88040)
#define	AD1		(*(volatile struct st_ad       *)0x88060)
#define	BSC		(*(volatile struct st_bsc      *)0x81300)
#define	CAN0	(*(volatile struct st_can      *)0x90200)
#define	CMT		(*(volatile struct st_cmt      *)0x88000)
#define	CMT0	(*(volatile struct st_cmt0     *)0x88002)
#define	CMT1	(*(volatile struct st_cmt0     *)0x88008)
#define	CMT2	(*(volatile struct st_cmt0     *)0x88012)
#define	CMT3	(*(volatile struct st_cmt0     *)0x88018)
#define	CRC		(*(volatile struct st_crc      *)0x88280)
#define	DA		(*(volatile struct st_da       *)0x880C0)
#define	DMAC	(*(volatile struct st_dmac     *)0x82200)
#define	DMAC0	(*(volatile struct st_dmac0    *)0x82000)
#define	DMAC1	(*(volatile struct st_dmac1    *)0x82040)
#define	DMAC2	(*(volatile struct st_dmac1    *)0x82080)
#define	DMAC3	(*(volatile struct st_dmac1    *)0x820C0)
#define	DTC		(*(volatile struct st_dtc      *)0x82400)
#define	EDMAC	(*(volatile struct st_edmac    *)0xC0000)
#define	ETHERC	(*(volatile struct st_etherc   *)0xC0100)
#define	EXDMAC	(*(volatile struct st_exdmac   *)0x82A00)
#define	EXDMAC0	(*(volatile struct st_exdmac0  *)0x82800)
#define	EXDMAC1	(*(volatile struct st_exdmac1  *)0x82840)
#define	FLASH	(*(volatile struct st_flash    *)0x8C288)
#define	ICU		(*(volatile struct st_icu      *)0x87000)
#define	IOPORT	(*(volatile struct st_ioport   *)0x8C100)
#define	IWDT	(*(volatile struct st_iwdt     *)0x88030)
#define	MTU0	(*(volatile struct st_mtu0     *)0x88700)
#define	MTU1	(*(volatile struct st_mtu1     *)0x88780)
#define	MTU2	(*(volatile struct st_mtu2     *)0x88800)
#define	MTU3	(*(volatile struct st_mtu3     *)0x88600)
#define	MTU4	(*(volatile struct st_mtu4     *)0x88600)
#define	MTU5	(*(volatile struct st_mtu5     *)0x88880)
#define	MTU6	(*(volatile struct st_mtu0     *)0x88B00)
#define	MTU7	(*(volatile struct st_mtu1     *)0x88B80)
#define	MTU8	(*(volatile struct st_mtu2     *)0x88C00)
#define	MTU9	(*(volatile struct st_mtu3     *)0x88A00)
#define	MTU10	(*(volatile struct st_mtu4     *)0x88A00)
#define	MTU11	(*(volatile struct st_mtu5     *)0x88C80)
#define	MTUA	(*(volatile struct st_mtua     *)0x8860A)
#define	MTUB	(*(volatile struct st_mtua     *)0x88A0A)
#define	POE		(*(volatile struct st_poe      *)0x88900)
#define	PORT0	(*(volatile struct st_port0    *)0x8C000)
#define	PORT1	(*(volatile struct st_port1    *)0x8C001)
#define	PORT2	(*(volatile struct st_port2    *)0x8C002)
#define	PORT3	(*(volatile struct st_port3    *)0x8C003)
#define	PORT4	(*(volatile struct st_port4    *)0x8C004)
#define	PORT5	(*(volatile struct st_port5    *)0x8C005)
#define	PORT6	(*(volatile struct st_port6    *)0x8C006)
#define	PORT7	(*(volatile struct st_port7    *)0x8C007)
#define	PORT8	(*(volatile struct st_port8    *)0x8C008)
#define	PORT9	(*(volatile struct st_port9    *)0x8C009)
#define	PORTA	(*(volatile struct st_porta    *)0x8C00A)
#define	PORTB	(*(volatile struct st_portb    *)0x8C00B)
#define	PORTC	(*(volatile struct st_portc    *)0x8C00C)
#define	PORTD	(*(volatile struct st_portd    *)0x8C00D)
#define	PORTE	(*(volatile struct st_porte    *)0x8C00E)
#define	PORTF	(*(volatile struct st_portf    *)0x8C00F)
#define	PORTG	(*(volatile struct st_portg    *)0x8C010)
#define	PPG0	(*(volatile struct st_ppg0     *)0x881E6)
#define	PPG1	(*(volatile struct st_ppg1     *)0x881F0)
#define	RIIC0	(*(volatile struct st_riic     *)0x88300)
#define	RIIC1	(*(volatile struct st_riic     *)0x88320)
#define	RSPI0	(*(volatile struct st_rspi     *)0x88380)
#define	RSPI1	(*(volatile struct st_rspi     *)0x883A0)
#define	RTC		(*(volatile struct st_rtc      *)0x8C400)
#define	S12AD	(*(volatile struct st_s12ad    *)0x89000)
#define	SCI0	(*(volatile struct st_sci      *)0x88240)
#define	SCI1	(*(volatile struct st_sci      *)0x88248)
#define	SCI2	(*(volatile struct st_sci      *)0x88250)
#define	SCI3	(*(volatile struct st_sci      *)0x88258)
#define	SCI5	(*(volatile struct st_sci      *)0x88268)
#define	SCI6	(*(volatile struct st_sci      *)0x88270)
#define	SMCI0	(*(volatile struct st_smci     *)0x88240)
#define	SMCI1	(*(volatile struct st_smci     *)0x88248)
#define	SMCI2	(*(volatile struct st_smci     *)0x88250)
#define	SMCI3	(*(volatile struct st_smci     *)0x88258)
#define	SMCI5	(*(volatile struct st_smci     *)0x88268)
#define	SMCI6	(*(volatile struct st_smci     *)0x88270)
#define	SYSTEM	(*(volatile struct st_system   *)0x80000)
#define	TMR0	(*(volatile struct st_tmr0     *)0x88200)
#define	TMR1	(*(volatile struct st_tmr1     *)0x88201)
#define	TMR2	(*(volatile struct st_tmr0     *)0x88210)
#define	TMR3	(*(volatile struct st_tmr1     *)0x88211)
#define	TMR01	(*(volatile struct st_tmr01    *)0x88204)
#define	TMR23	(*(volatile struct st_tmr01    *)0x88214)
#define	USB		(*(volatile struct st_usb      *)0xA0400)
#define	USB0	(*(volatile struct st_usb0     *)0xA0000)
#define	USB1	(*(volatile struct st_usb0     *)0xA0200)
#define	WDT		(*(volatile union un_wdt       *)0x88028)
#endif

